9/data/attachments/908abde1a227d649.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Lance_public_Friend_4686_6</nif:username>
            <nif:friendToBeRequested>soap_friends_b9e16bab-8608-4bc4-8d04-c9a69ef54cc2</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>